app/Widgets/ListRoomChat.php

select `rooms`.`id`, `rooms`.`name`, `room_users`.`user_id` from `rooms` inner join `room_users` on `rooms`.`id` = `room_users`.`room_id` where `room_users`.`user_id` = '2'
---
    public function run()
    {
        //get listroom user has join
        $roomJoined = DB::table('rooms')->join('room_users','rooms.id','=','room_users.room_id')->where('room_users.user_id','=',Auth::user()->id)
        ->select('rooms.id','rooms.name','room_users.user_id')
        ->get();