app/Widgets/ListUserChat.php

select * from `users` where `users`.`id` = '1' limit 1
select * from `notifprivate` inner join `users` on `users`.`id` = `notifprivate`.`from` where `notifprivate`.`from` = '1' and `notifprivate`.`to` = '2' limit 1
---
    public function run()
    {

        $ids = PrivateMessage::where('from','=',Auth::user()->id)
            ->orWhere('to','=',Auth::user()->id)
            ->orderBy('created_at','DESC')
            ->select('from','to')->get();
        $arr_id = array();
        foreach ($ids as $id){
            if(Auth::user()->id == $id->to){
                array_push($arr_id,$id->from);
            }else{
                array_push($arr_id,$id->to);
            }
        }
        $arr_id = array_unique($arr_id);
        $del_key = array_search(Auth::user()->id, $arr_id);
        if($del_key !== false){
            unset($arr_id[$del_key]);
        }
        $arr_id = array_slice($arr_id,0,5);
        $users = new Collection();
        foreach ($arr_id as $id){
            $user = User::findOrFail($id);
            //kiem tra user co thong bao hay khong
            $status = DB::table('notifprivate')
                ->join('users','users.id','=','notifprivate.from')
                ->where('notifprivate.from','=',$user->id)
                ->where('notifprivate.to','=',Auth::user()->id)->first();