app/Widgets/MessageRoom.php

    public function run($id)
    {
        $room = Room::findOrFail($id);

        $checkJoin = RoomUser::where('user_id', Auth::id())->where('room_id', $id)->first();
        if($checkJoin == null){
            $isJoin = 0;
        }else{
            $isJoin = 1;
        }

        $listMemberOrRoom = RoomUser::where('room_id', $id)->get()->toArray();
---
select * from `rooms` where `rooms`.`id` = '1' limit 1
select * from `room_users` where `user_id` = '2' and `room_id` = '1' limit 1
select * from `room_users` where `room_id` = '1'