app/Http/Controllers/Frontend/MessengesController.php

    public function room($id)
    {
    	$room = Room::findOrFail($id);

    	$checkJoin = RoomUser::where('user_id', Auth::id())->where('room_id', $id)->first();
    	if($checkJoin == null){
    		$isJoin = 0;
    	}else{
    		$isJoin = 1;
    	}
    	$messages = DB::table('messenges')
                ->join('users','users.id','=','messenges.user_id')
                ->select('users.avatar', 'messenges.*')
                ->take(100)
                ->orderBy('messenges.id','ASC')
                ->get();
        foreach ($messages as $key => $chat){
            $chat->content = self::getNewContent($chat->content);
        }
        $listFile = File::where('room_id', $id)->get();
---
select * from `rooms` where `rooms`.`id` = '1' limit 1
select * from `room_users` where `user_id` = '2' and `room_id` = '1' limit 1
select * from `files` where `room_id` = '1'
select `users`.`avatar`, `users`.`name`, `users`.`fullname`, `messenges`.* from `messenges` inner join `users` on `users`.`id` = `messenges`.`user_id` where `messenges`.`room_id` = '1' order by `messenges`.`id` asc limit 100
select * from `room_users` where `room_id` = '1'

    public function addRoomMessage(Request $request){
     //   \Log::info($request);
        $message = new Messenges();
        $message->user_id = $request['user']['id'];
        $message->room_id = $request['room']['id'];
        $message->content = $request['message'];
        $message->status = true;
        $message->save();

        $message->content = self::getNewContent($message->content);
        $avatar = User::where('id','=',$message->user_id)->select('avatar')->first();
---
insert into `messenges` (`user_id`, `room_id`, `content`, `status`, `updated_at`, `created_at`) values ('162', '61', 'asa', '1', '2017-07-26 17:21:59', '2017-07-26 17:21:59')
select `avatar` from `users` where `id` = '162' limit 1

    public static function getNewContent($content)
    {
        $output = "";
        $arr_text = explode(" ",$content);
        foreach ($arr_text as $str){
            $code = $str;
            $image = Emotion::where('code','=',$code)
                ->select('image')->first();
---
select `image` from `emotions` where `code` = 'lamhas' limit 1