app/Http/Controllers/Frontend/PrivateChatController.php

select `id` from `users` where `name` = 'admin' limit 1
select * from `privates` where `from` = '2' and `to` = '1' or `from` = '1' and `to` = '2'
select * from `notifprivate` where `from` = '1' and `to` = '2' limit 1
select * from `users` where `name` = 'admin' limit 1
select * from `friendship` where `user_request` = '2' and `user_accept` = '1' or `user_request` = '1' and `user_accept` = '2' limit 1
---
    public function user($username)
    {
        $userid = User::where('name','=',$username)->select('id')->first();

        //xoa thong bao tu user nay neu co
        $notif = NotifPrivate::where('from','=',$userid->id)
                                ->where('to','=',Auth::user()->id)
                                ->first();
        if($notif!= null){
            $notif->delete();
        }
    	$user = Auth::user();
    	$toUser = User::where('name',$username)->first();
        if ($toUser == null) {
            abort(404);
        }

        if($toUser->name == $user->name){
            return redirect()->route('account.edit', $user->id);
        }
        $friendship = FriendShip::where('user_request','=',$user->id)
            ->where('user_accept','=',$toUser->id)
            ->orWhere('user_request','=',$toUser->id)
            ->where('user_accept','=',$user->id)
            ->first();