app/Http/Controllers/Frontend/RoomController.php

select * from `room_users` where `user_id` = '2'
select * from `rooms` where `id` not in ('1', '18', '18') order by RAND() limit 16
---
    public function index()
    {
        $listRoomJoined = RoomUser::where('user_id', Auth::id())->get();
        $arrayRoomJoin = array_pluck($listRoomJoined->toArray(), 'room_id');
        $listRoomRandom = DB::table('rooms')->whereNotIn('id', $arrayRoomJoin)->orderByRaw("RAND()")->take(16)->get();

select * from `rooms` where `rooms`.`id` = '61' limit 1
select * from `room_users` where `user_id` = '162' and `room_id` = '61' limit 1
delete from `room_users` where `id` = '6'
insert into `messenges` (`user_id`, `room_id`, `content`, `status`, `updated_at`, `created_at`) values ('162', '61', 'hung has left', '0', '2017-07-26 17:20:40', '2017-07-26 17:20:40')
select * from `room_users` where `room_id` = '61'
---
    public function leave($id)
    {
        $room = Room::findOrFail($id);

        $roomUser = RoomUser::where('user_id', Auth::id())->where('room_id', $id)->first();
        $roomUser->delete();

        //add message leave to db
        Messenges::create([
            'user_id' => Auth::id(),
             'room_id' => $id,
             'content' => Auth::user()->name . ' has left',
             'status' => false
        ]);

        // Delete room when nobody in room
        $checkRoomMember = RoomUser::where('room_id', $id)->get();

select * from `rooms` where `rooms`.`id` = '61' limit 1
insert into `room_users` (`user_id`, `room_id`, `updated_at`, `created_at`) values ('162', '61', '2017-07-26 17:21:03', '2017-07-26 17:21:03')
insert into `messenges` (`user_id`, `room_id`, `content`, `status`, `updated_at`, `created_at`) values ('162', '61', 'hung has joined', '0', '2017-07-26 17:21:03', '2017-07-26 17:21:03')
---
    public function join($id)
    {
        $room = Room::findOrFail($id);

        $roomUser = new RoomUser;
        $roomUser->user_id = Auth::id();
        $roomUser->room_id = $id;
        $roomUser->save();

        Messenges::create([
            'user_id' => Auth::id(),
            'room_id' => $id,
            'content' => Auth::user()->name . ' has joined',
            'status' => false
        ]);

select * from `files` where `room_id` = '61' and `id` = '25' limit 1
---
    public function changeVideo($room_id, Request $request){
        $file_id = $request->file_id;
        $file = File::where('room_id', $room_id)->where('id', $file_id)->first();